In [2]:
%load_ext sql

In [3]:
from sqlalchemy import create_engine

In [4]:
%sql postgresql://postgres:root@localhost/Practice

# Question

In [5]:
%%sql


CREATE TABLE funds 
(
    id	VARCHAR(512),
    name	VARCHAR(512)
);

INSERT INTO funds (id, name) VALUES
	('1', 'ABC Growth Fund'),
	('2', 'XYZ Balanced Fund'),
	('3', '123 Income Fund');

 * postgresql://postgres:***@localhost/Practice
Done.
3 rows affected.

[]

In [8]:
%%sql

CREATE TABLE coupon_payments 
(
    fund_id	VARCHAR(512),
    payment	DECIMAL(5,2)
);

INSERT INTO coupon_payments (fund_id, payment) VALUES
	('1', '111.54'),
	('1', '285.20'),
	('1', '310.82'),
	('1', '445.74'),
	('1', '835.56'),
	('1', '904.96'),
	('1', '948.93'),
	('2', '106.52'),
	('2', '458.95'),
	('2', '467.75'),
	('2', '513.84'),
	('2', '690.27'),
	('2', '734.65'),
	('2', '736.84'),
	('2', '770.69'),
	('3', '175.08'),
	('3', '241.42'),
	('3', '361.97'),
	('3', '414.86'),
    ('3', '873.43');

 * postgresql://postgres:***@localhost/Practice
Done.
20 rows affected.

[]

In [11]:
%%sql

select * from funds;

 * postgresql://postgres:***@localhost/Practice
3 rows affected.

[('1', 'ABC Growth Fund'),
 ('2', 'XYZ Balanced Fund'),
 ('3', '123 Income Fund')]

In [12]:
%%sql

select * from coupon_payments;

 * postgresql://postgres:***@localhost/Practice
20 rows affected.

[('1', Decimal('111.54')),
 ('1', Decimal('285.20')),
 ('1', Decimal('310.82')),
 ('1', Decimal('445.74')),
 ('1', Decimal('835.56')),
 ('1', Decimal('904.96')),
 ('1', Decimal('948.93')),
 ('2', Decimal('106.52')),
 ('2', Decimal('458.95')),
 ('2', Decimal('467.75')),
 ('2', Decimal('513.84')),
 ('2', Decimal('690.27')),
 ('2', Decimal('734.65')),
 ('2', Decimal('736.84')),
 ('2', Decimal('770.69')),
 ('3', Decimal('175.08')),
 ('3', Decimal('241.42')),
 ('3', Decimal('361.97')),
 ('3', Decimal('414.86')),
 ('3', Decimal('873.43'))]

## Solution

In [35]:
%%sql

select f.name, count(c.payment) as total_payments, MIN(c.payment) as min_payment, MAX(c.payment) as max_payment
        , ROUND(AVG(c.payment), 2) as avg_payment
from coupon_payments c
join funds f on f.id = c.fund_id
GROUP BY c.fund_id, f.name
HAVING AVG(c.payment) > 500.00
ORDER BY total_payments

 * postgresql://postgres:***@localhost/Practice
2 rows affected.

[('ABC Growth Fund', 7, Decimal('111.54'), Decimal('948.93'), Decimal('548.96')),
 ('XYZ Balanced Fund', 8, Decimal('106.52'), Decimal('770.69'), Decimal('559.94'))]